Masmiseim36/nxpSDK/boards/evkbmimxrt1170/demo_apps/mc_bldc/cm7/pin_mux.h
/*
    * Copyright 2024 NXP
    *
    * SPDX-License-Identifier: BSD-3-Clause
*/
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);                    /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLPUART(void);                  /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPWM(void);                     /* Function assigned for the Cortex-M7F */

/* GPIO_AD_11 (coord P16), CUR_A */
/* Routed pin properties */
#define BOARD_INITADC_CUR_A_ADC1_PERIPHERAL                               LPADC1   /*!< Peripheral name */
#define BOARD_INITADC_CUR_A_ADC1_SIGNAL                                        B   /*!< Signal name */
#define BOARD_INITADC_CUR_A_ADC1_CHANNEL                                      1U   /*!< Signal channel */

/* GPIO_AD_12 (coord P17), CUR_B */
/* Routed pin properties */
#define BOARD_INITADC_CUR_B_ADC1_PERIPHERAL                               LPADC1   /*!< Peripheral name */
#define BOARD_INITADC_CUR_B_ADC1_SIGNAL                                        A   /*!< Signal name */
#define BOARD_INITADC_CUR_B_ADC1_CHANNEL                                      1U   /*!< Signal channel */

/* GPIO_AD_13 (coord L12), CUR_C_ADC1 */
/* Routed pin properties */
#define BOARD_INITADC_CUR_C_ADC1_PERIPHERAL                               LPADC1   /*!< Peripheral name */
#define BOARD_INITADC_CUR_C_ADC1_SIGNAL                                        B   /*!< Signal name */
#define BOARD_INITADC_CUR_C_ADC1_CHANNEL                                      1U   /*!< Signal channel */

/* GPIO_AD_12 (coord P17), CUR_B */
/* Routed pin properties */
#define BOARD_INITADC_CUR_B_ADC2_PERIPHERAL                               LPADC2   /*!< Peripheral name */
#define BOARD_INITADC_CUR_B_ADC2_SIGNAL                                        A   /*!< Signal name */
#define BOARD_INITADC_CUR_B_ADC2_CHANNEL                                      2U   /*!< Signal channel */

/* GPIO_AD_13 (coord L12), CUR_C_ADC1 */
/* Routed pin properties */
#define BOARD_INITADC_CUR_C_ADC2_PERIPHERAL                               LPADC2   /*!< Peripheral name */
#define BOARD_INITADC_CUR_C_ADC2_SIGNAL                                        B   /*!< Signal name */
#define BOARD_INITADC_CUR_C_ADC2_CHANNEL                                      2U   /*!< Signal channel */

/* GPIO_AD_08 (coord R15), VOLT_DCB */
/* Routed pin properties */
#define BOARD_INITADC_VOLT_DCB_PERIPHERAL                                 LPADC1   /*!< Peripheral name */
#define BOARD_INITADC_VOLT_DCB_SIGNAL                                          A   /*!< Signal name */
#define BOARD_INITADC_VOLT_DCB_CHANNEL                                        1U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitADC(void);                     /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitENC(void);                     /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCMP(void);                     /* Function assigned for the Cortex-M7F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
